import ollama
prompt=""" 比分整理成 json 只有比分和隊伍就好  
         this is format 
        "score_team_1": ,
        "score_team_2":  ,
        "team_1_name":  ,
        "team_1_name":  ,
        """
content="""中華職棒35年例行賽編號266場次富邦悍將作客天母棒球場對決主隊味全龍，原訂8/17（六）比賽進行到四局下龍隊得點圈靠著適時安打取得3:1領銜，受到雨勢影響形成保留比賽，移至今天原場地天母棒球場進行補賽，勝投頒給郭郁政中繼3局失1分，單場MVP李凱威單場三安猛打跑回1分1打點；關鍵五局下龍隊吉力吉撈．鞏冠、蔣少宏連續安打上壘，劉基鴻擊出左外野二壘安打帶有1分打點、林孝程高飛犧牲打再添1分為比賽定調，終場味全龍以5:3獲勝。龍隊先發伍鐸二局上達成個人第1100局投球局數，CPBL聯盟史上第10位達成投手，本場主投4局失1分非自責無關勝敗退場，郭郁政中繼3局失1分，林凱威收下本季第12次中繼成功，陳冠偉0.2局被敲3安有一次保送留下滿壘危機退場，老將陳禹勳久違登板關門收下勝利。悍將先發，江國豪主投4局失3分吞敗，接替投球黃保羅中繼4局失兩分，打線全場敲11安，劉俊豪刷新個人生涯新高單場4安打表現最為突出，蔡佳諺個人生涯首支三壘安打。"""
response = ollama.chat(model='llama3.2:3b', messages=[
  {
    'role': 'user',
    'content': prompt+content,
  },
])
print("llama3.2 3b")
print(response['message']['content']) 